mediaMicroservices/wrk2/nospec3_60s_r60.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 964.521ms, rate sampling interval: 4407ms
  Thread calibration: mean lat.: 1050.027ms, rate sampling interval: 4100ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.03s     3.90s   15.05s    67.27%
    Req/Sec    22.48      5.79    30.00     78.26%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.34s 
 75.000%    6.99s 
 90.000%   11.07s 
 99.000%   15.05s 
 99.900%   16.05s 
 99.990%   16.65s 
 99.999%   16.65s 
100.000%   16.65s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      80.447     0.000000            1         1.00
     660.479     0.100000          228         1.11
    1444.863     0.200000          456         1.25
    2064.383     0.300000          684         1.43
    3246.079     0.400000          912         1.67
    4341.759     0.500000         1140         2.00
    4923.391     0.550000         1254         2.22
    5279.743     0.600000         1368         2.50
    5906.431     0.650000         1482         2.86
    6512.639     0.700000         1597         3.33
    6987.775     0.750000         1710         4.00
    7475.199     0.775000         1767         4.44
    8273.919     0.800000         1825         5.00
    8921.087     0.825000         1882         5.71
    9740.287     0.850000         1938         6.67
   10502.143     0.875000         1995         8.00
   10723.327     0.887500         2023         8.89
   11083.775     0.900000         2052        10.00
   11534.335     0.912500         2080        11.43
   11935.743     0.925000         2109        13.33
   12632.063     0.937500         2137        16.00
   12902.399     0.943750         2151        17.78
   13131.775     0.950000         2166        20.00
   13451.263     0.956250         2180        22.86
   13631.487     0.962500         2195        26.67
   13811.711     0.968750         2208        32.00
   13918.207     0.971875         2215        35.56
   14049.279     0.975000         2223        40.00
   14303.231     0.978125         2230        45.71
   14409.727     0.981250         2237        53.33
   14663.679     0.984375         2244        64.00
   14852.095     0.985938         2247        71.11
   14974.975     0.987500         2251        80.00
   15032.319     0.989062         2255        91.43
   15065.087     0.990625         2258       106.67
   15187.967     0.992188         2262       128.00
   15196.159     0.992969         2263       142.22
   15253.503     0.993750         2265       160.00
   15384.575     0.994531         2267       182.86
   15671.295     0.995313         2269       213.33
   15785.983     0.996094         2271       256.00
   15785.983     0.996484         2271       284.44
   15826.943     0.996875         2272       320.00
   15859.711     0.997266         2273       365.71
   15908.863     0.997656         2274       426.67
   15941.631     0.998047         2275       512.00
   15941.631     0.998242         2275       568.89
   15949.823     0.998437         2276       640.00
   15949.823     0.998633         2276       731.43
   16048.127     0.998828         2277       853.33
   16048.127     0.999023         2277      1024.00
   16048.127     0.999121         2277      1137.78
   16154.623     0.999219         2278      1280.00
   16154.623     0.999316         2278      1462.86
   16154.623     0.999414         2278      1706.67
   16154.623     0.999512         2278      2048.00
   16154.623     0.999561         2278      2275.56
   16654.335     0.999609         2279      2560.00
   16654.335     1.000000         2279          inf
#[Mean    =     5033.131, StdDeviation   =     3904.222]
#[Max     =    16646.144, Total count    =         2279]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2840 requests in 1.00m, 517.07KB read
  Non-2xx or 3xx responses: 40
Requests/sec:     47.33
Transfer/sec:      8.62KB