mediaMicroservices/wrk2/nospec3_60s_r75.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 1777.148ms, rate sampling interval: 6762ms
  Thread calibration: mean lat.: 1957.510ms, rate sampling interval: 7364ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.17s     6.33s   27.46s    64.76%
    Req/Sec    21.46      3.32    28.00     76.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.92s 
 75.000%   15.47s 
 90.000%   20.28s 
 99.000%   27.46s 
 99.900%   29.92s 
 99.990%   30.11s 
 99.999%   30.11s 
100.000%   30.11s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1776.639     0.000000            1         1.00
    4120.575     0.100000          215         1.11
    5156.863     0.200000          430         1.25
    6402.047     0.300000          645         1.43
    7905.279     0.400000          860         1.67
    9920.511     0.500000         1074         2.00
   10985.471     0.550000         1182         2.22
   11968.511     0.600000         1292         2.50
   12877.823     0.650000         1398         2.86
   14303.231     0.700000         1504         3.33
   15466.495     0.750000         1611         4.00
   16457.727     0.775000         1665         4.44
   17170.431     0.800000         1719         5.00
   17842.175     0.825000         1773         5.71
   18497.535     0.850000         1827         6.67
   19218.431     0.875000         1880         8.00
   19660.799     0.887500         1907         8.89
   20316.159     0.900000         1934        10.00
   20938.751     0.912500         1961        11.43
   21839.871     0.925000         1987        13.33
   22544.383     0.937500         2014        16.00
   22740.991     0.943750         2028        17.78
   23019.519     0.950000         2041        20.00
   23511.039     0.956250         2055        22.86
   24133.631     0.962500         2068        26.67
   24707.071     0.968750         2081        32.00
   24838.143     0.971875         2088        35.56
   25247.743     0.975000         2095        40.00
   25624.575     0.978125         2102        45.71
   26181.631     0.981250         2108        53.33
   26755.071     0.984375         2115        64.00
   26935.295     0.985938         2118        71.11
   27115.519     0.987500         2122        80.00
   27361.279     0.989062         2125        91.43
   27459.583     0.990625         2128       106.67
   28295.167     0.992188         2132       128.00
   28311.551     0.992969         2133       142.22
   28409.855     0.993750         2135       160.00
   28950.527     0.994531         2137       182.86
   29196.287     0.995313         2138       213.33
   29540.351     0.996094         2140       256.00
   29589.503     0.996484         2141       284.44
   29786.111     0.996875         2142       320.00
   29818.879     0.997266         2143       365.71
   29818.879     0.997656         2143       426.67
   29851.647     0.998047         2144       512.00
   29884.415     0.998242         2145       568.89
   29884.415     0.998437         2145       640.00
   29917.183     0.998633         2146       731.43
   29917.183     0.998828         2146       853.33
   29917.183     0.999023         2146      1024.00
   30081.023     0.999121         2147      1137.78
   30081.023     0.999219         2147      1280.00
   30081.023     0.999316         2147      1462.86
   30081.023     0.999414         2147      1706.67
   30081.023     0.999512         2147      2048.00
   30113.791     0.999561         2148      2275.56
   30113.791     1.000000         2148          inf
#[Mean    =    11167.163, StdDeviation   =     6326.816]
#[Max     =    30097.408, Total count    =         2148]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2675 requests in 1.00m, 481.17KB read
  Non-2xx or 3xx responses: 3
Requests/sec:     44.57
Transfer/sec:      8.02KB