mediaMicroservices/wrk2/oneone3_60s_r100.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 3831.218ms, rate sampling interval: 10264ms
  Thread calibration: mean lat.: 3364.497ms, rate sampling interval: 9256ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.95s     4.67s   21.58s    55.86%
    Req/Sec    33.56      4.30    40.00     55.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.94s 
 75.000%   15.58s 
 90.000%   18.37s 
 99.000%   21.58s 
 99.900%   23.22s 
 99.990%   23.41s 
 99.999%   23.41s 
100.000%   23.41s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3567.615     0.000000            1         1.00
    5685.247     0.100000          338         1.11
    6692.863     0.200000          675         1.25
    9248.767     0.300000         1012         1.43
   10838.015     0.400000         1349         1.67
   11935.743     0.500000         1687         2.00
   12632.063     0.550000         1855         2.22
   13287.423     0.600000         2025         2.50
   13983.743     0.650000         2192         2.86
   14573.567     0.700000         2360         3.33
   15581.183     0.750000         2531         4.00
   16072.703     0.775000         2614         4.44
   16506.879     0.800000         2700         5.00
   16859.135     0.825000         2784         5.71
   17334.271     0.850000         2869         6.67
   17907.711     0.875000         2952         8.00
   18120.703     0.887500         2993         8.89
   18366.463     0.900000         3037        10.00
   18595.839     0.912500         3080        11.43
   18808.831     0.925000         3120        13.33
   19103.743     0.937500         3162        16.00
   19202.047     0.943750         3182        17.78
   19382.271     0.950000         3203        20.00
   19742.719     0.956250         3224        22.86
   19988.479     0.962500         3245        26.67
   20316.159     0.968750         3267        32.00
   20512.767     0.971875         3278        35.56
   20611.071     0.975000         3288        40.00
   20676.607     0.978125         3298        45.71
   20922.367     0.981250         3309        53.33
   21135.359     0.984375         3319        64.00
   21331.967     0.985938         3324        71.11
   21413.887     0.987500         3329        80.00
   21528.575     0.989062         3335        91.43
   21725.183     0.990625         3340       106.67
   21839.871     0.992188         3346       128.00
   21987.327     0.992969         3348       142.22
   22052.863     0.993750         3350       160.00
   22478.847     0.994531         3353       182.86
   22740.991     0.995313         3356       213.33
   22790.143     0.996094         3358       256.00
   22904.831     0.996484         3360       284.44
   22921.215     0.996875         3361       320.00
   22937.599     0.997266         3362       365.71
   23085.055     0.997656         3364       426.67
   23134.207     0.998047         3366       512.00
   23134.207     0.998242         3366       568.89
   23134.207     0.998437         3366       640.00
   23150.591     0.998633         3367       731.43
   23216.127     0.998828         3368       853.33
   23216.127     0.999023         3368      1024.00
   23347.199     0.999121         3369      1137.78
   23347.199     0.999219         3369      1280.00
   23347.199     0.999316         3369      1462.86
   23412.735     0.999414         3371      1706.67
   23412.735     1.000000         3371          inf
#[Mean    =    11951.352, StdDeviation   =     4666.462]
#[Max     =    23396.352, Total count    =         3371]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3918 requests in 1.00m, 708.75KB read
  Non-2xx or 3xx responses: 28
Requests/sec:     65.29
Transfer/sec:     11.81KB